In [2]:
import pandas as pd

In [11]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [13]:
df.loc[0] = ["Allen", 22, 175]

In [14]:
df.loc[1] = ["Evans", 30, 166]
df.loc[2] = ["John", 32, 172]
df

    Name  Age  Height
0  Allen   22     175
1  Evans   30     166
2   John   32     172

In [15]:
df["Weight"] = [75, 58, 62]

In [17]:
df.drop(["Weight"], axis=1) # 執行這個時還沒被真正刪除，只會先試跑執行結果

    Name  Age  Height
0  Allen   22     175
1  Evans   30     166
2   John   32     172

In [19]:
df = df.drop(["Weight"], axis=1) #將df assign 回去才會被刪除

In [20]:
df

    Name  Age  Height
0  Allen   22     175
1  Evans   30     166
2   John   32     172

In [21]:
df.drop(2)

    Name  Age  Height
0  Allen   22     175
1  Evans   30     166

In [25]:
df['Height'] = 190

In [27]:
columns = ["Name", "Age", "Height"]
data =[
    ["Jake", 26, 180],
    ["Tom", 31, 159]
]
df2 = pd.DataFrame(
    data = data,
    columns = columns,
)

df2

   Name  Age  Height
0  Jake   26     180
1   Tom   31     159

In [28]:
#合併檔案
df_union = pd.concat(
    [df, df2]
)
df_union

    Name  Age  Height
0  Allen   22     190
1  Evans   30     190
2   John   32     190
0   Jake   26     180
1    Tom   31     159

In [32]:
#改index 會多給一個新的index
df_union = pd.concat(
    [df, df2]
).reset_index()
df_union

   index   Name  Age  Height
0      0  Allen   22     190
1      1  Evans   30     190
2      2   John   32     190
3      0   Jake   26     180
4      1    Tom   31     159

In [33]:
df_union = pd.concat(
    [df, df2]
).reset_index(drop=True)
df_union

    Name  Age  Height
0  Allen   22     190
1  Evans   30     190
2   John   32     190
3   Jake   26     180
4    Tom   31     159

In [34]:
#轉成csv
df_union.to_csv("basic.csv")

In [35]:
df_union.to_csv("basic.csv", index=False)

In [36]:
#不要columns
df_union.to_csv(
    "basic_no_column.csv",
    index=False,
    header=None,
    )